Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML10_DFP/3.9.116/atdf/ATSAML10E15A.atdf
        <module name="ADC" id="U2247" version="2.4.0">
          <instance name="ADC">
            <register-group name="ADC" name-in-module="ADC" address-space="base" offset="0x42001C00"/>
            <signals>
              <signal group="AIN" index="0" function="B" pad="PA02"/>
              <signal group="AIN" index="1" function="B" pad="PA03"/>
              <signal group="AIN" index="2" function="B" pad="PA04"/>
              <signal group="AIN" index="3" function="B" pad="PA05"/>
              <signal group="AIN" index="4" function="B" pad="PA06"/>
              <signal group="AIN" index="5" function="B" pad="PA07"/>
              <signal group="AIN" index="6" function="B" pad="PA08"/>
              <signal group="AIN" index="7" function="B" pad="PA09"/>
              <signal group="AIN" index="8" function="B" pad="PA10"/>
              <signal group="AIN" index="9" function="B" pad="PA11"/>
              <signal group="VREFP" function="B" pad="PA04"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RESRDY" value="19" caption="index of DMA RESRDY trigger"/>
              <param name="EXTCHANNEL_MSB" value="9" caption="Number of external channels"/>
              <param name="GCLK_ID" value="16" caption="index of Generic Clock"/>
              <param name="INT_CH30" value="1" caption="Select OPAMP or CTAT on Channel 30"/>
              <param name="MASTER_SLAVE_MODE" value="0" caption="ADC Master/Slave Mode"/>
              <param name="INSTANCE_ID" value="71"/>
              <param name="LOAD_CALIB" value="1" caption="CALIB register to be loaded from NVM"/>
            </parameters>
          </instance>
        </module>
        <module name="CCL" id="U2225" version="2.0.0">
          <instance name="CCL">
            <register-group name="CCL" name-in-module="CCL" address-space="base" offset="0x42002C00"/>
            <signals>
              <signal group="IN" index="0" function="I" pad="PA04"/>
              <signal group="IN" index="0" function="I" pad="PA16"/>
              <signal group="IN" index="1" function="I" pad="PA05"/>
              <signal group="IN" index="1" function="I" pad="PA17"/>
              <signal group="IN" index="2" function="I" pad="PA06"/>
              <signal group="IN" index="2" function="I" pad="PA18"/>
              <signal group="IN" index="3" function="I" pad="PA08"/>
              <signal group="IN" index="3" function="I" pad="PA30"/>
              <signal group="IN" index="4" function="I" pad="PA09"/>
              <signal group="IN" index="5" function="I" pad="PA10"/>
              <signal group="OUT" index="0" function="I" pad="PA07"/>
              <signal group="OUT" index="0" function="I" pad="PA19"/>
              <signal group="OUT" index="1" function="I" pad="PA11"/>
              <signal group="OUT" index="1" function="I" pad="PA31"/>
            </signals>
            <parameters>
              <param name="GCLK_ID" value="20" caption="GCLK index for CCL"/>
              <param name="LUT_NUM" value="2" caption="Number of LUT in a CCL"/>
              <param name="SEQ_NUM" value="1" caption="Number of SEQ in a CCL"/>
              <param name="INSTANCE_ID" value="75"/>
            </parameters>
          </instance>
        </module>
        <module name="DAC" id="U2214" version="2.1.0">
          <instance name="DAC">
            <register-group name="DAC" name-in-module="DAC" address-space="base" offset="0x42002000"/>
            <signals>
              <signal group="VOUT" function="B" pad="PA02"/>
              <signal group="VREFP" function="B" pad="PA03"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_EMPTY" value="20" caption="Index of DMA EMPTY trigger"/>
              <param name="GCLK_ID" value="18"/>
              <param name="INSTANCE_ID" value="72"/>
            </parameters>
          </instance>
        </module>
        <module name="DMAC" id="U2223" version="2.4.0">
          <instance name="DMAC">
            <register-group name="DMAC" name-in-module="DMAC" address-space="base" offset="0x41006000"/>
            <parameters>
              <param name="CH_BITS" value="3" caption="Number of bits to select channel"/>
              <param name="CH_NUM" value="8" caption="Number of channels"/>
              <param name="EVIN_NUM" value="4" caption="Number of input events"/>
              <param name="EVOUT_NUM" value="4" caption="Number of output events"/>
              <param name="LVL_BITS" value="2" caption="Number of bit to select level priority"/>
              <param name="LVL_NUM" value="4" caption="Enable priority level number"/>
              <param name="QOSCTRL_D_RESETVALUE" value="2" caption="QOS dmac ahb interface reset value"/>
              <param name="QOSCTRL_F_RESETVALUE" value="2" caption="QOS dmac fetch interface reset value"/>
              <param name="QOSCTRL_WRB_RESETVALUE" value="2" caption="QOS dmac write back interface reset value"/>
              <param name="TRIG_BITS" value="5" caption="Number of bits to select trigger source"/>
              <param name="TRIG_NUM" value="24" caption="Number of peripheral triggers"/>
              <param name="CHANNEL0_INT_SRC" value="11" caption="DMA Channel 0 Interrupt"/>
              <param name="CHANNEL1_INT_SRC" value="12" caption="DMA Channel 1 Interrupt"/>
              <param name="CHANNEL2_INT_SRC" value="13" caption="DMA Channel 2 Interrupt"/>
              <param name="CHANNEL3_INT_SRC" value="14" caption="DMA Channel 3 Interrupt"/>
              <param name="CHANNEL4_INT_SRC" value="15" caption="DMA Channel 4 Interrupt"/>
              <param name="CHANNEL5_INT_SRC" value="15" caption="DMA Channel 5 Interrupt"/>
              <param name="CHANNEL6_INT_SRC" value="15" caption="DMA Channel 6 Interrupt"/>
              <param name="CHANNEL7_INT_SRC" value="15" caption="DMA Channel 7 Interrupt"/>
              <param name="INSTANCE_ID" value="35"/>
            </parameters>
          </instance>
        </module>
        <module name="DSU" id="U2810" version="1.0.0">
          <instance name="DSU">
            <register-group name="DSU" name-in-module="DSU" address-space="base" offset="0x41002000"/>
            <register-group name="DSU_EXT" name-in-module="DSU" address-space="base" offset="0x41002100" size="0x100"/>
            <parameters>
              <param name="DMAC_ID_DCC0" value="2" caption="DMAC ID for DCC0 register"/>
              <param name="DMAC_ID_DCC1" value="3" caption="DMAC ID for DCC1 register"/>
              <param name="INSTANCE_ID" value="33"/>
            </parameters>
          </instance>
        </module>
        <module name="EIC" id="U2804" version="1.0.0">
          <instance name="EIC">
            <register-group name="EIC" name-in-module="EIC" address-space="base" offset="0x40002800"/>
            <signals>
              <signal group="EXTINT" index="0" function="A" pad="PA09"/>
              <signal group="EXTINT" index="0" function="A" pad="PA19"/>
              <signal group="EXTINT" index="0" function="A" pad="PA00"/>
              <signal group="EXTINT" index="1" function="A" pad="PA10"/>
              <signal group="EXTINT" index="1" function="A" pad="PA22"/>
              <signal group="EXTINT" index="1" function="A" pad="PA01"/>
              <signal group="EXTINT" index="2" function="A" pad="PA02"/>
              <signal group="EXTINT" index="2" function="A" pad="PA11"/>
              <signal group="EXTINT" index="2" function="A" pad="PA23"/>
              <signal group="EXTINT" index="3" function="A" pad="PA03"/>
              <signal group="EXTINT" index="3" function="A" pad="PA14"/>
              <signal group="EXTINT" index="3" function="A" pad="PA24"/>
              <signal group="EXTINT" index="4" function="A" pad="PA04"/>
              <signal group="EXTINT" index="4" function="A" pad="PA15"/>
              <signal group="EXTINT" index="4" function="A" pad="PA25"/>
              <signal group="EXTINT" index="5" function="A" pad="PA05"/>
              <signal group="EXTINT" index="5" function="A" pad="PA16"/>
              <signal group="EXTINT" index="5" function="A" pad="PA27"/>
              <signal group="EXTINT" index="6" function="A" pad="PA06"/>
              <signal group="EXTINT" index="6" function="A" pad="PA17"/>
              <signal group="EXTINT" index="6" function="A" pad="PA30"/>
              <signal group="EXTINT" index="7" function="A" pad="PA07"/>
              <signal group="EXTINT" index="7" function="A" pad="PA18"/>
              <signal group="EXTINT" index="7" function="A" pad="PA31"/>
              <signal group="NMI" function="A" pad="PA08"/>
            </signals>
            <parameters>
              <param name="EXTINT_NUM" value="8" caption="Number of external interrupts"/>
              <param name="GCLK_ID" value="3" caption="Generic Clock index"/>
              <param name="NUMBER_OF_CONFIG_REGS" value="1" caption="Number of CONFIG registers"/>
              <param name="NUMBER_OF_DPRESCALER_REGS" value="1" caption="Number of DPRESCALER registers"/>
              <param name="NUMBER_OF_INTERRUPTS" value="8" caption="Number of external interrupts (obsolete)"/>
              <param name="SECURE_IMPLEMENTED" value="1" caption="Security Configuration implemented?"/>
              <param name="INSTANCE_ID" value="10"/>
            </parameters>
          </instance>
        </module>
