Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML10_DFP/3.9.116/atdf/ATSAML10E15A.atdf
      <register-group name="EVSYS" caption="Event System Interface">
        <register name="CTRLA" offset="0x0" rw="W" size="1" initval="0x00" caption="Control">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
        </register>
        <register name="SWEVT" offset="0x4" rw="W" size="4" initval="0x00000000" caption="Software Event">
          <bitfield name="CHANNEL0" caption="Channel 0 Software Selection" mask="0x1"/>
          <bitfield name="CHANNEL1" caption="Channel 1 Software Selection" mask="0x2"/>
          <bitfield name="CHANNEL2" caption="Channel 2 Software Selection" mask="0x4"/>
          <bitfield name="CHANNEL3" caption="Channel 3 Software Selection" mask="0x8"/>
          <bitfield name="CHANNEL4" caption="Channel 4 Software Selection" mask="0x10"/>
          <bitfield name="CHANNEL5" caption="Channel 5 Software Selection" mask="0x20"/>
          <bitfield name="CHANNEL6" caption="Channel 6 Software Selection" mask="0x40"/>
          <bitfield name="CHANNEL7" caption="Channel 7 Software Selection" mask="0x80"/>
        </register>
        <register name="PRICTRL" offset="0x8" rw="RW" size="1" initval="0x00" caption="Priority Control">
          <bitfield name="PRI" caption="Channel Priority Number" mask="0x3"/>
          <bitfield name="RREN" caption="Round-Robin Scheduling Enable" mask="0x80"/>
        </register>
        <register name="INTPEND" offset="0x10" rw="RW" size="2" initval="0x4000" caption="Channel Pending Interrupt">
          <bitfield name="ID" caption="Channel ID" mask="0x3"/>
          <bitfield name="OVR" caption="Channel Overrun" mask="0x100"/>
          <bitfield name="EVD" caption="Channel Event Detected" mask="0x200"/>
          <bitfield name="READY" caption="Ready" mask="0x4000"/>
          <bitfield name="BUSY" caption="Busy" mask="0x8000"/>
        </register>
        <register name="INTSTATUS" offset="0x14" rw="R" size="4" initval="0x00000000" caption="Interrupt Status">
          <bitfield name="CHINT0" caption="Channel 0 Pending Interrupt" mask="0x1"/>
          <bitfield name="CHINT1" caption="Channel 1 Pending Interrupt" mask="0x2"/>
          <bitfield name="CHINT2" caption="Channel 2 Pending Interrupt" mask="0x4"/>
          <bitfield name="CHINT3" caption="Channel 3 Pending Interrupt" mask="0x8"/>
        </register>
        <register name="BUSYCH" offset="0x18" rw="R" size="4" initval="0x00000000" caption="Busy Channels">
          <bitfield name="BUSYCH0" caption="Busy Channel 0" mask="0x1"/>
          <bitfield name="BUSYCH1" caption="Busy Channel 1" mask="0x2"/>
          <bitfield name="BUSYCH2" caption="Busy Channel 2" mask="0x4"/>
          <bitfield name="BUSYCH3" caption="Busy Channel 3" mask="0x8"/>
        </register>
        <register name="READYUSR" offset="0x1C" rw="R" size="4" initval="0xFFFFFFFF" caption="Ready Users">
          <bitfield name="READYUSR0" caption="Ready User for Channel 0" mask="0x1"/>
          <bitfield name="READYUSR1" caption="Ready User for Channel 1" mask="0x2"/>
          <bitfield name="READYUSR2" caption="Ready User for Channel 2" mask="0x4"/>
          <bitfield name="READYUSR3" caption="Ready User for Channel 3" mask="0x8"/>
        </register>
        <register-group name="CHANNEL" name-in-module="CHANNEL" offset="0x020" size="0x8" count="8"/>
        <register name="USER" offset="0x120" rw="RW" size="1" count="23" initval="0x00" caption="User Multiplexer n">
          <bitfield name="CHANNEL" caption="Channel Event Selection" mask="0xF"/>
        </register>
        <register name="INTENCLR" offset="0x1D4" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00000000" caption="Interrupt Enable Clear">
          <bitfield name="NSCHK" caption="Non-Secure Check Interrupt Enable" mask="0x1"/>
        </register>
        <register name="INTENSET" offset="0x1D5" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00000000" caption="Interrupt Enable Set">
          <bitfield name="NSCHK" caption="Non-Secure Check Interrupt Enable" mask="0x1"/>
        </register>
        <register name="INTFLAG" offset="0x1D6" rw="RW" size="1" atomic-op="clear:INTFLAG" initval="0x00000000" caption="Interrupt Flag Status and Clear">
          <bitfield name="NSCHK" caption="Non-Secure Check" mask="0x1"/>
        </register>
        <register name="NONSECCHAN" offset="0x1D8" rw="RW" size="4" initval="0x00000000" caption="Channels Security Attribution">
          <bitfield name="CHANNEL0" caption="Non-Secure for Channel 0" mask="0x1"/>
          <bitfield name="CHANNEL1" caption="Non-Secure for Channel 1" mask="0x2"/>
          <bitfield name="CHANNEL2" caption="Non-Secure for Channel 2" mask="0x4"/>
          <bitfield name="CHANNEL3" caption="Non-Secure for Channel 3" mask="0x8"/>
          <bitfield name="CHANNEL4" caption="Non-Secure for Channel 4" mask="0x10"/>
          <bitfield name="CHANNEL5" caption="Non-Secure for Channel 5" mask="0x20"/>
          <bitfield name="CHANNEL6" caption="Non-Secure for Channel 6" mask="0x40"/>
          <bitfield name="CHANNEL7" caption="Non-Secure for Channel 7" mask="0x80"/>
        </register>
        <register name="NSCHKCHAN" offset="0x1DC" rw="RW" size="4" initval="0x00000000" caption="Non-Secure Channels Check">
          <bitfield name="CHANNEL0" caption="Channel 0 to be checked as non-secured" mask="0x1"/>
          <bitfield name="CHANNEL1" caption="Channel 1 to be checked as non-secured" mask="0x2"/>
          <bitfield name="CHANNEL2" caption="Channel 2 to be checked as non-secured" mask="0x4"/>
          <bitfield name="CHANNEL3" caption="Channel 3 to be checked as non-secured" mask="0x8"/>
          <bitfield name="CHANNEL4" caption="Channel 4 to be checked as non-secured" mask="0x10"/>
          <bitfield name="CHANNEL5" caption="Channel 5 to be checked as non-secured" mask="0x20"/>
          <bitfield name="CHANNEL6" caption="Channel 6 to be checked as non-secured" mask="0x40"/>
          <bitfield name="CHANNEL7" caption="Channel 7 to be checked as non-secured" mask="0x80"/>
        </register>
        <register name="NONSECUSER" offset="0x1E0" rw="RW" size="4" count="1" initval="0x00000000" caption="Users Security Attribution">
          <bitfield name="USER0" caption="Non-Secure for User 0" mask="0x1"/>
          <bitfield name="USER1" caption="Non-Secure for User 1" mask="0x2"/>
          <bitfield name="USER2" caption="Non-Secure for User 2" mask="0x4"/>
          <bitfield name="USER3" caption="Non-Secure for User 3" mask="0x8"/>
          <bitfield name="USER4" caption="Non-Secure for User 4" mask="0x10"/>
          <bitfield name="USER5" caption="Non-Secure for User 5" mask="0x20"/>
          <bitfield name="USER6" caption="Non-Secure for User 6" mask="0x40"/>
          <bitfield name="USER7" caption="Non-Secure for User 7" mask="0x80"/>
          <bitfield name="USER8" caption="Non-Secure for User 8" mask="0x100"/>
          <bitfield name="USER9" caption="Non-Secure for User 9" mask="0x200"/>
          <bitfield name="USER10" caption="Non-Secure for User 10" mask="0x400"/>
          <bitfield name="USER11" caption="Non-Secure for User 11" mask="0x800"/>
          <bitfield name="USER12" caption="Non-Secure for User 12" mask="0x1000"/>
          <bitfield name="USER13" caption="Non-Secure for User 13" mask="0x2000"/>
          <bitfield name="USER14" caption="Non-Secure for User 14" mask="0x4000"/>
          <bitfield name="USER15" caption="Non-Secure for User 15" mask="0x8000"/>
          <bitfield name="USER16" caption="Non-Secure for User 16" mask="0x10000"/>
          <bitfield name="USER17" caption="Non-Secure for User 17" mask="0x20000"/>
          <bitfield name="USER18" caption="Non-Secure for User 18" mask="0x40000"/>
          <bitfield name="USER19" caption="Non-Secure for User 19" mask="0x80000"/>
          <bitfield name="USER20" caption="Non-Secure for User 20" mask="0x100000"/>
          <bitfield name="USER21" caption="Non-Secure for User 21" mask="0x200000"/>
          <bitfield name="USER22" caption="Non-Secure for User 22" mask="0x400000"/>
        </register>
        <register name="NSCHKUSER" offset="0x1F0" rw="RW" size="4" count="1" initval="0x00000000" caption="Non-Secure Users Check">
          <bitfield name="USER0" caption="User 0 to be checked as non-secured" mask="0x1"/>
          <bitfield name="USER1" caption="User 1 to be checked as non-secured" mask="0x2"/>
          <bitfield name="USER2" caption="User 2 to be checked as non-secured" mask="0x4"/>
          <bitfield name="USER3" caption="User 3 to be checked as non-secured" mask="0x8"/>
          <bitfield name="USER4" caption="User 4 to be checked as non-secured" mask="0x10"/>
          <bitfield name="USER5" caption="User 5 to be checked as non-secured" mask="0x20"/>
          <bitfield name="USER6" caption="User 6 to be checked as non-secured" mask="0x40"/>
          <bitfield name="USER7" caption="User 7 to be checked as non-secured" mask="0x80"/>
          <bitfield name="USER8" caption="User 8 to be checked as non-secured" mask="0x100"/>
          <bitfield name="USER9" caption="User 9 to be checked as non-secured" mask="0x200"/>
          <bitfield name="USER10" caption="User 10 to be checked as non-secured" mask="0x400"/>
          <bitfield name="USER11" caption="User 11 to be checked as non-secured" mask="0x800"/>
          <bitfield name="USER12" caption="User 12 to be checked as non-secured" mask="0x1000"/>
          <bitfield name="USER13" caption="User 13 to be checked as non-secured" mask="0x2000"/>
          <bitfield name="USER14" caption="User 14 to be checked as non-secured" mask="0x4000"/>
          <bitfield name="USER15" caption="User 15 to be checked as non-secured" mask="0x8000"/>
          <bitfield name="USER16" caption="User 16 to be checked as non-secured" mask="0x10000"/>
          <bitfield name="USER17" caption="User 17 to be checked as non-secured" mask="0x20000"/>
          <bitfield name="USER18" caption="User 18 to be checked as non-secured" mask="0x40000"/>
          <bitfield name="USER19" caption="User 19 to be checked as non-secured" mask="0x80000"/>
          <bitfield name="USER20" caption="User 20 to be checked as non-secured" mask="0x100000"/>
          <bitfield name="USER21" caption="User 21 to be checked as non-secured" mask="0x200000"/>
          <bitfield name="USER22" caption="User 22 to be checked as non-secured" mask="0x400000"/>
        </register>
      </register-group>
      <value-group name="EVSYS_CHANNEL__EDGSEL">
        <value name="NO_EVT_OUTPUT" caption="No event output when using the resynchronized or synchronous path" value="0"/>
        <value name="RISING_EDGE" caption="Event detection only on the rising edge of the signal from the event generator when using the resynchronized or synchronous path" value="1"/>
        <value name="FALLING_EDGE" caption="Event detection only on the falling edge of the signal from the event generator when using the resynchronized or synchronous path" value="2"/>
        <value name="BOTH_EDGES" caption="Event detection on rising and falling edges of the signal from the event generator when using the resynchronized or synchronous path" value="3"/>
      </value-group>
      <value-group name="EVSYS_CHANNEL__PATH">
        <value name="SYNCHRONOUS" caption="Synchronous path" value="0"/>
        <value name="RESYNCHRONIZED" caption="Resynchronized path" value="1"/>
        <value name="ASYNCHRONOUS" caption="Asynchronous path" value="2"/>
      </value-group>
    </module>
    <module name="FREQM" id="U2257" version="2.1.0" caption="Frequency Meter">
      <register-group name="FREQM" caption="Frequency Meter">
        <register name="CTRLA" offset="0x0" rw="RW" size="1" initval="0x00" caption="Control A Register">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
        </register>
        <register name="CTRLB" offset="0x1" rw="W" size="1" initval="0x00" caption="Control B Register">
          <bitfield name="START" caption="Start Measurement" mask="0x1"/>
        </register>
