Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML10_DFP/3.9.116/atdf/ATSAML10E15A.atdf
      <value-group name="WDT_CONFIG__WINDOW">
        <value name="CYC8" caption="8 clock cycles" value="0x0"/>
        <value name="CYC16" caption="16 clock cycles" value="0x1"/>
        <value name="CYC32" caption="32 clock cycles" value="0x2"/>
        <value name="CYC64" caption="64 clock cycles" value="0x3"/>
        <value name="CYC128" caption="128 clock cycles" value="0x4"/>
        <value name="CYC256" caption="256 clock cycles" value="0x5"/>
        <value name="CYC512" caption="512 clock cycles" value="0x6"/>
        <value name="CYC1024" caption="1024 clock cycles" value="0x7"/>
        <value name="CYC2048" caption="2048 clock cycles" value="0x8"/>
        <value name="CYC4096" caption="4096 clock cycles" value="0x9"/>
        <value name="CYC8192" caption="8192 clock cycles" value="0xA"/>
        <value name="CYC16384" caption="16384 clock cycles" value="0xB"/>
      </value-group>
      <value-group name="WDT_EWCTRL__EWOFFSET">
        <value name="CYC8" caption="8 clock cycles" value="0x0"/>
        <value name="CYC16" caption="16 clock cycles" value="0x1"/>
        <value name="CYC32" caption="32 clock cycles" value="0x2"/>
        <value name="CYC64" caption="64 clock cycles" value="0x3"/>
        <value name="CYC128" caption="128 clock cycles" value="0x4"/>
        <value name="CYC256" caption="256 clock cycles" value="0x5"/>
        <value name="CYC512" caption="512 clock cycles" value="0x6"/>
        <value name="CYC1024" caption="1024 clock cycles" value="0x7"/>
        <value name="CYC2048" caption="2048 clock cycles" value="0x8"/>
        <value name="CYC4096" caption="4096 clock cycles" value="0x9"/>
        <value name="CYC8192" caption="8192 clock cycles" value="0xA"/>
        <value name="CYC16384" caption="16384 clock cycles" value="0xB"/>
      </value-group>
    </module>
    <module name="OPAMP" id="U2237" version="2.0.0" caption="Operational Amplifier">
      <register-group name="OPAMP" caption="Operational Amplifier">
        <register name="CTRLA" offset="0x0" rw="RW" size="1" initval="0x00" caption="Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="LPMUX" caption="Low-Power Mux" mask="0x80"/>
        </register>
        <register name="STATUS" offset="0x2" rw="R" size="1" initval="0x00" caption="Status">
          <bitfield name="READY0" caption="OPAMP 0 Ready" mask="0x1"/>
          <bitfield name="READY1" caption="OPAMP 1 Ready" mask="0x2"/>
          <bitfield name="READY2" caption="OPAMP 2 Ready" mask="0x4"/>
        </register>
        <register name="OPAMPCTRL0" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="OPAMP0 Control">
          <bitfield name="ENABLE" caption="Operational Amplifier Enable" mask="0x2"/>
          <bitfield name="ANAOUT" caption="Analog Output" mask="0x4"/>
          <bitfield name="BIAS" caption="Bias Selection" mask="0x18"/>
          <bitfield name="RES2VCC" caption="Resistor ladder To VCC" mask="0x20"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
          <bitfield name="ONDEMAND" caption="On Demand Control" mask="0x80"/>
          <bitfield name="RES2OUT" caption="Resistor ladder To Output" mask="0x100"/>
          <bitfield name="RES1EN" caption="Resistor 1 Enable" mask="0x200"/>
          <bitfield name="RES1MUX" caption="Resistor 1 Mux" mask="0x1C00" values="OPAMP_OPAMPCTRL0__RES1MUX"/>
          <bitfield name="POTMUX" caption="Potentiometer Selection" mask="0xE000" values="OPAMP_OPAMPCTRL__POTMUX"/>
          <bitfield name="MUXPOS" caption="Positive Input Mux Selection" mask="0xF0000" values="OPAMP_OPAMPCTRL0__MUXPOS"/>
          <bitfield name="MUXNEG" caption="Negative Input Mux Selection" mask="0xF00000" values="OPAMP_OPAMPCTRL0__MUXNEG"/>
        </register>
        <register name="OPAMPCTRL1" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="OPAMP1 Control">
          <bitfield name="ENABLE" caption="Operational Amplifier Enable" mask="0x2"/>
          <bitfield name="ANAOUT" caption="Analog Output" mask="0x4"/>
          <bitfield name="BIAS" caption="Bias Selection" mask="0x18"/>
          <bitfield name="RES2VCC" caption="Resistor ladder To VCC" mask="0x20"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
          <bitfield name="ONDEMAND" caption="On Demand Control" mask="0x80"/>
          <bitfield name="RES2OUT" caption="Resistor ladder To Output" mask="0x100"/>
          <bitfield name="RES1EN" caption="Resistor 1 Enable" mask="0x200"/>
          <bitfield name="RES1MUX" caption="Resistor 1 Mux" mask="0x1C00" values="OPAMP_OPAMPCTRL1__RES1MUX"/>
          <bitfield name="POTMUX" caption="Potentiometer Selection" mask="0xE000" values="OPAMP_OPAMPCTRL__POTMUX"/>
          <bitfield name="MUXPOS" caption="Positive Input Mux Selection" mask="0xF0000" values="OPAMP_OPAMPCTRL1__MUXPOS"/>
          <bitfield name="MUXNEG" caption="Negative Input Mux Selection" mask="0xF00000" values="OPAMP_OPAMPCTRL0__MUXNEG"/>
        </register>
        <register name="OPAMPCTRL2" offset="0xC" rw="RW" size="4" initval="0x00000000" caption="OPAMP2 Control">
          <bitfield name="ENABLE" caption="Operational Amplifier Enable" mask="0x2"/>
          <bitfield name="ANAOUT" caption="Analog Output" mask="0x4"/>
          <bitfield name="BIAS" caption="Bias Selection" mask="0x18"/>
          <bitfield name="RES2VCC" caption="Resistor ladder To VCC" mask="0x20"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
          <bitfield name="ONDEMAND" caption="On Demand Control" mask="0x80"/>
          <bitfield name="RES2OUT" caption="Resistor ladder To Output" mask="0x100"/>
          <bitfield name="RES1EN" caption="Resistor 1 Enable" mask="0x200"/>
          <bitfield name="RES1MUX" caption="Resistor 1 Mux" mask="0x1C00" values="OPAMP_OPAMPCTRL2__RES1MUX"/>
          <bitfield name="POTMUX" caption="Potentiometer Selection" mask="0xE000" values="OPAMP_OPAMPCTRL__POTMUX"/>
          <bitfield name="MUXPOS" caption="Positive Input Mux Selection" mask="0xF0000" values="OPAMP_OPAMPCTRL2__MUXPOS"/>
          <bitfield name="MUXNEG" caption="Negative Input Mux Selection" mask="0xF00000" values="OPAMP_OPAMPCTRL0__MUXNEG"/>
        </register>
        <register name="RESCTRL" offset="0x10" rw="RW" size="1" initval="0x00" caption="Resister Control">
          <bitfield name="RES2OUT" caption="Resistor ladder To Output" mask="0x1"/>
          <bitfield name="RES1EN" caption="Resistor 1 Enable" mask="0x2"/>
          <bitfield name="RES1MUX" caption="Resistor 1 Mux" mask="0x4" values="OPAMP_RESCTRL__RES1MUX"/>
          <bitfield name="POTMUX" caption="Potentiometer Selection" mask="0x38" values="OPAMP_RESCTRL__POTMUX"/>
          <bitfield name="REFBUFLEVEL" caption="Reference output voltage level select" mask="0xC0" values="OPAMP_RESCTRL__REFBUFLEVEL"/>
        </register>
      </register-group>
